# Visibility Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GeometryObject..::..Visibility Property
GeometryObject Class See Also
---
The visibility.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public Visibility Visibility { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Visibility As Visibility
	Get
```

Visual C++
---
```text
public:
property Visibility Visibility {
	Visibility get ();
}
```

# Remarks
The visibility of this object has no effect on the visibility of objects contained within this object. For example, the visibility of a Solid may be Contextual but the faces within that solid may still be Visible.
# See Also
GeometryObject Class
Autodesk.Revit.DB Namespace